# NumberOfVertices Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriOrQuadFacet..::..NumberOfVertices Property
TriOrQuadFacet Class See Also
---
The number of vertices (3 for a triangle, 4 for a quadrilateral, 0 for an unset TriOrQuadFacet).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int NumberOfVertices { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfVertices As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfVertices {
	int get ();
}
```

# See Also
TriOrQuadFacet Class
Autodesk.Revit.DB Namespace